# 1. Write SQL query to show all the data in the Movie table.

In [4]:
SELECT * FROM Movie;

SyntaxError: invalid syntax (1882178606.py, line 1)

# 2. Write SQL query to show the title of the longest runtime movie.

In [3]:
SELECT title FROM movies
WHERE runtime = (SELECT MAX(runtime) FROM movies)

SyntaxError: invalid syntax (3462066665.py, line 1)

# 3. Write SQL query to show the highest revenue generating movie title.

In [2]:
SELECT title
FROM film
WHERE film_id IN ("highest revenue")

SELECT film_id
FROM inventory
WHERE inventory_id IN (
        SELECT inventory_id
        FROM rental
        GROUP BY inventory_id
        ORDER BY count(inventory_id) DESC
        ) limit(highest revenue);

SyntaxError: invalid syntax (773542467.py, line 1)

# 4. Write SQL query to show the movie title with maximum value of revenue/budget.

In [1]:
SELECT Movies, max( revenue ) as max_revenue FROM
`movie` GROUP BY movies

SyntaxError: invalid syntax (3982578939.py, line 1)

# 5. Write a SQL query to show the movie title and its cast details like name of the person, gender, character name, cast order.

In [5]:
SELECT m.title, p.name, p.gender, c.character_name, c.cast_order
FROM movie m
INNER JOIN cast c ON m.id = c.movie_id
INNER JOIN person p ON c.person_id = p.id
ORDER BY m.title, c.cast_order
```

SyntaxError: invalid syntax (2912049464.py, line 1)

# 6.Write a SQL query to show the country name where maximum number of movies has been produced, along with the number of movies produced.

In [ ]:
SELECT country, COUNT(*) AS count
FROM movies
GROUP BY country
ORDER BY count DESC
LIMIT 1

# 7. Write a SQL query to show all the genre_id in one column and genre_name in second column.

In [ ]:
SELECT genre_id, genre_name
FROM genre

# 8. Write a SQL query to show name of all the languages in one column and number of movies in that particular column in another column.

In [ ]:
SELECT language, COUNT(*) AS "Number of Movies"
FROM movies
GROUP BY language
ORDER BY "Number of Movies" DESC

# 9. Write a SQL query to show movie name in first column, no. of crew members in second column and number of cast members in third column.

In [ ]:
SELECT title, COUNT(crew.id) AS crew_count, COUNT(cast.id) AS cast_count
FROM movies
LEFT JOIN crew ON movies.id = crew.movie_id
LEFT JOIN cast ON movies.id = cast.movie_id
GROUP BY movies.id
ORDER BY crew_count DESC, cast_count DESC
``

# 10. Write a SQL query to list top 10 movies title according to popularity column in decreasing order

In [ ]:
SELECT title, popularity 
FROM movies 
ORDER BY popularity DESC 
LIMIT 10

# 11. Write a SQL query to show the name of the 3rd most revenue generating movie and its revenue.

In [ ]:
SELECT name, revenue 
FROM movies 
ORDER BY revenue DESC 
LIMIT 2,1

# 12. Write a SQL query to show the names of all the movies which have “rumoured” movie status.

In [ ]:
SELECT name 
FROM movies 
WHERE status = 'rumoured'

# 13. Write a SQL query to show the name of the “United States of America” produced movie which generated maximum revenue

In [ ]:
select country, revenue
from reporting r
where revenue = (select max(revenue) from reporting r2 where r.country = United Sates of America )
group by country

# 14. Write a SQL query to print the movie_id in one column and name of the production company in the second column for all the movies.

# 15. Write a SQL query to show the title of top 20 movies arranged in decreasing order of their budget.